///<proj_info>
//==============================================================================
// 项目名 : 智能监控
// 文件名 : CameraServer.h
// 作  者 : 王磊
// 用  途 : 相机服务类CameraServer,内含线程任务Task()处理相机消息和图像
//          内含处理文件夹监控子线程DirWatchServer对象
// 版  权 : 霍比特人
//==============================================================================
///</proj_info>

///<ver_info>
// 版本记录	
//==============================================================================
//版本号  开发人员      时间      描述
//1.0     王磊        2016.3.20  整合旧版本
//==============================================================================
///</ver_info>

///<header_info>
//==============================================================================
//添加所需的头文件
#pragma once
#include "DirWatcher.h"
#include "Thread.h"
#include "CommonDefine.h"
//==============================================================================
///</header_info>

///<class_info>
//==============================================================================
//功能描述: 相机服务类CameraServer,内含线程任务Task()处理相机消息和图像
//          内含处理文件夹监控子线程DirWatchServer对象
class CameraServer:public Thread
{
//类功能
public:
	CameraServer(HANDLE  hParent = 0);
	~CameraServer();
//文件监控
public:
	DirWatchServer *pDirWatchServer;

//线程功能
public:
    //创建线程
	void  Create(int times = -1, long waiteTime = 0, bool includeTaskTime = true);
	//设置参数使主函数退出以销毁线程
	void  Destroy(void);
	//处理pDirWatchServer中的图像队列
	void Task();
};
//==============================================================================
///</class_info>





