///<proj_info>
//==============================================================================
// 项目名 ：智能监控
// 文件名 ：ArWatch.h
// 作  者 ：杨朝霖
// 用  途 ：局部作用域计时类
//          利用局部作用域原理
//			1:局部作用域内声明时开始计时,局部作用域结束,析构时输出时间
//			2:或用SetData()指定计时内存(局部作用域外),销毁时输出时间到指定内存
// 版  权 ：霍比特人
//==============================================================================
///</proj_info>

///<ver_info>
// 版本记录	
//==============================================================================
//版本号  开发人员      时间      描述
//1.0     王磊        2014.5.1   整合旧版本
//==============================================================================
///</ver_info>

//---------------------------------------------------------------------------
#ifndef ArWatchH
#define ArWatchH
#include <windows.h>
//---------------------------------------------------------------------------

///<class_info>
//==============================================================================
//功能描述:局部作用域计时类
//{
//	ArWatch watch;
//	Do something...
//		...
//}>> wsprintf timeUsed
//double timeStoreHere;
//{
//	ArWatch watch;
//	watch.SetData(&timeStoreHere);
//	Do something...
//		...
//}>> wsprintf timeUsed
//Get timeStoreHere;
class ArWatch
{
public:
    void SetData(double* pTime);
    ArWatch();
    ~ArWatch();
private:
    LARGE_INTEGER m_liStart, m_liEnd, m_liFrequency;
    double m_dCycle;
    double*  m_pTime;
};
#endif
//==============================================================================
///</class_info>